{
    "slug": "vision-fridge",
    "title": "Vision Fridge",
    "projectInfo": {
      "timeFrame": "10 weeks",
      "teamSize": "7",
      "technologies": ["React Native", "Typescript"],
      "redirectLink": ""
    },
    "introduction": [
      "This app was developed by a team of 7 including myself during my internship at *San Diego Supercomputer Center (SDSC)*. This experience taught me a lot about agile development and helped me hone both my technical and soft skills. The app aims to help college students cook more nutritious meals whilst also promoting food sustainability and giving users a platform to share their cooking with friends.",
      "My contributions to this project include the UI for the login, onboarding, profile, settings, recipes catalogue, social feed and camera pages. On top of that, one of my teammates and I were in charge of creating wireframes and a style guide for the app. Finally, I was also assigned to be the *build master* for the team. This meant I was in charge of all merge requests and maintaining a clean, stable version of our code."
    ],
    "learned": [
      "This is a template.",
      "This is the second paragraph."
    ],
    "details": [
      {
        "sectionTitle": "Agile Development",
        "sectionAttachment1": "",
        "sectionAttachment2": "",
        "content": [
          "Our team worked in 2 week sprints with daily scrum meetings. I found the daily meetings the most helpful as it would give us the opportunity to share our progress on a feature, any blockers to our work as well as consult other developers if we were struggling to complete a task. At the end of each sprint, our team would do a quick retrospective on what we think went well and what could've been improved from the last sprint and plan for the upcoming sprint by setting clear goals and tasks with estimated time frames to complete each task to ensure we were on track to meet the deadline.",
          "I also learned the importance of proper planning."
        ]
      },
      {
        "sectionTitle": "Template",
        "sectionAttachment1": "test.webp",
        "sectionAttachment2": "",
        "content": [
          "This is a test template.",
          "This is the second paragraph."
        ] 
      }
    ]
  }